Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Then, you can see what the `master` branch on the `origin` remote was the last time you communicated with the server, by checking the `refs/remotes/origin/master` file:
cs: Poté se můžete podívat, jakou podobu měla větev `master` na vzdáleném serveru `origin`, když jste s ním naposledy komunikovali. Pomůže vám s tím soubor `refs/remotes/origin/master`:

source: Then, you can send a request to the maintainer of the main project to pull in your changes.
cs: Poté odešlete správci hlavního projektu žádost, aby do projektu natáhl vaše změny.

source: Then, you can use a branch name in any Git command that expects a commit object or SHA-1 value.
cs: V takovém případě můžete použít název větve v libovolném příkazu Git, který vyžaduje objekt revize nebo hodnotu SHA-1.

source: Then, you e-mail that guy and yell at him.
cs: Nyní znáte provinilcovu e-mailovou adresu a můžete mu vyčinit.

source: Then, you must tell bisect when the last known good state was, using `git bisect good [good_commit]`:
cs: Poté musíte nástroji bisect sdělit, kdy byl kód naposled nepochybně funkční. K tomu použijete příkaz `git bisect good [good_commit]`:

source: Then, you specify the mode, SHA-1, and filename:
cs: K tomu všemu přidáte režim, SHA-1 a název souboru:

source: Then, your editor will open to something like this for your placeholder commit message when you commit:
cs: Při zapisování revize váš editor otevře následující šablonu zprávy k revizi:

source: There are a couple of interesting things here.
cs: Výstup obsahuje řadu zajímavých informací.

source: There are a couple of minor differences in the configuration file; but for your purpose, this is close to the same thing.
cs: Bude tu sice pár menších rozdílů v konfiguračním souboru, ale pro náš účel můžeme příkazy považovat za ekvivalentní.

source: There are a couple of reasons for this — the object could be in an alternate repository, or it could be in a packfile in this repository.
cs: Chyba má hned několik příčin. Objekt by mohl být v jiném repozitáři nebo by mohl být v tomto repozitáři, avšak v balíčkovém souboru.

source: There are a few ways you can give access to everyone on your team.
cs: Existuje několik způsobů, jak umožnit přístup všem členům vašeho týmu.

source: There are a lot of client-side hooks.
cs: Na straně klienta existuje mnoho zásuvných modulů.

source: There are a lot of great things about Git, but one feature that can cause issues is the fact that a `git clone` downloads the entire history of the project, including every version of every file.
cs: Systém Git nabízí velké množství úžasných funkcí a možností. Je však jedna věc, která vám může způsobovat problém. Je jí fakt, že příkaz `git clone` stáhne vždy celou historii projektu, všechny verze všech souborů.

source: There are also more interesting ways to do this on a per-user basis via ACLs, as you’ll learn at the end of this chapter.
cs: A jak uvidíte na konci kapitoly, existují ještě další zajímavé způsoby, jak provést stejné nastavení na bázi jednotlivých uživatelů prostřednictvím ACL.

source: There are different ways to initiate the `upload-pack` process on the remote repository.
cs: Existují i jiné způsoby, jak iniciovat proces `upload-pack` ve vzdáleném repozitáři.

source: There are three easy ways to install Git on a Mac.
cs: Existují tři jednoduché způsoby, jak nainstalovat Git v systému Mac.

source: There are two groups of these hooks: client side and server side.
cs: Rozlišujeme dvě skupiny těchto zásuvných modulů (háčků, angl. hooks): na straně klienta a na straně serveru.

source: There are two levels of access control in Gitolite.
cs: V Gitolite jsou dvě úrovně kontroly přístupů.

source: There are two sets of processes for transferring data: a pair for uploading data and a pair for downloading data.
cs: Existují dvě sady procesů pro přenos dat: jeden pár pro upload dat a jeden pár pro jejich stahování.

source: There are two ways to apply an e-mailed patch: with `git apply` or with `git am`.
cs: Existují dva způsoby aplikace záplaty z e-mailu: příkazem `git apply` nebo příkazem `git am`.

source: There are useful `--merged` and `--no-merged` options available in Git for this purpose.
cs: K tomuto účelu slouží v systému Git od verze 1.5.6 užitečné příkazy `--merged` a `--no-merged`.

source: There are ways to get around this (namely, stashing and commit amending) that we’ll cover later.
cs: Existují způsoby, jak to obejít (jmenovitě odložení (stashing) a doplnění revize (commit amending)), těm se však budeme věnovat až později.

source: There is a `--word-diff` option available in Git, that you can append to the `git log -p` command to get word diff instead of normal line by line diff.
cs: Git nabízí parametr `--word-diff`, který můžeme přidat za příkaz `git log -p`. Místo obvyklé detekce rozdílů po řádcích získáme rozdíly po slovech.

source: There is a bit of a problem — she needs to push the merged work in her `featureB` branch to the `featureBee` branch on the server.
cs: Tady nastává určitý problém. Musí odeslat práci začleněnou ve své větvi `featureB` do větve `featureBee` na serveru.

source: There is another history-rewriting option that you can use if you need to rewrite a larger number of commits in some scriptable way — for instance, changing your e-mail address globally or removing a file from every commit.
cs: Existuje ještě další možnost přepisu historie, kterou vám Git nabízí pro případy, kdy potřebujete skriptovatelným způsobem přepsat větší počet revizí, např. globálně změnit e-mailovou adresu nebo odstranit jeden soubor ze všech revizí.

source: There is no canonical version of any project, which allows a project to move from one user to another seamlessly if the first author abandons the project.
cs: Neexistuje tu žádná standardní verze projektu, která by umožňovala kompletní přechod projektu z jednoho uživatele na druhého, jestliže první autor projekt ukončí.

source: There is no difference in the end product of the integration, but rebasing makes for a cleaner history.
cs: V koncových produktech integrace není žádný rozdíl, výsledkem přeskládání je však čistší historie.

source: There is only one packfile on the server, so your object is obviously in there, but you’ll check the index file to make sure.
cs: Na serveru je pouze jeden balíčkový soubor, takže váš objekt musí být evidentně v něm. Pro jistotu se však ještě podíváte do souboru indexu.

source: There may also be occasional changes to this section itself, so you may also want to look at the latest version [here][gldpg].
cs: Tato podkapitola se může občas změnit, takže se možná chcete podívat na její [poslední verzi][gldpg].

source: There you go — a nice, clean Git repository.
cs: A máme to tu — krásný, čistý repozitář Git.

source: There, you can do a mixed reset of that commit with `git reset HEAD^`, which effectively undoes that commit and leaves the modified files unstaged.
cs: Odtud můžete vytvořit smíšený reset této revize zadáním příkazu `git reset HEAD^`, který efektivně vrátí všechny změny v revizi a ponechá změněné soubory nepřipraveny k zapsání.

source: Therefore, the preferred method for collaborating with someone is to set up an intermediate repository that you both have access to, and push to and pull from that.
cs: Jako nejlepší metodu spolupráce s ostatními proto můžeme doporučit nastavení „neutrálního“ repozitáře, do nějž budete mít všichni přístup, budete do něj moci odesílat data a budete z něj moci stahovat.

source: These are generally automatically generated files such as log files or files produced by your build system.
cs: Jedná se většinou o automaticky vygenerované soubory, jako soubory log nebo soubory vytvořené při překladu.

source: These are some commonly used workflows that are possible with a distributed system like Git, but you can see that many variations are possible to suit your particular real-world workflow.
cs: Toto jsou tedy některé z běžně používaných pracovních postupů, které můžete využít v distribuovaných systémech, jako je například Git. Uvidíte ale, že na pozadí vašich konkrétních potřeb v reálných situacích lze vytvořit celou řadu variací na tyto postupy.

source: These are the "clean" and "smudge" filters.
cs: Jedná se o filtry clean a smudge.

source: These are the core parts of Git.
cs: To jsou ústřední součásti adresáře Git.

source: These channels are regularly filled with hundreds of people who are all very knowledgeable about Git and are often willing to help.
cs: Na těchto kanálech se většinou pohybují stovky lidí, kteří mají se systémem Git bohaté zkušenosti a často ochotně pomohou. (Nutno ovšem podotknout, že se na těchto kanálech mluví anglicky – pozn. překl.)

source: These commands are generally referred to as "plumbing" commands, and the more user-friendly commands are called "porcelain" commands.
cs: Těmto příkazům většinou říkáme „nízkoúrovňové“ (angl. plumbing commands), zatímco uživatelsky přívětivější příkazy označujeme jako „vysokoúrovňové“ (porcelain commands).

source: These commands are nice because you can access them anywhere, even offline.
cs: Tyto příkazy jsou užitečné, neboť je můžete spustit kdykoli, dokonce i offline.

source: These commands aren’t meant to be used manually on the command line, but rather to be used as building blocks for new tools and custom scripts.
cs: Nepředpokládám, že byste chtěli tyto příkazy používat osamoceně na příkazovém řádku. Podíváme se na ně spíše jako na stavební kameny pro nové nástroje a skripty.

source: These days, you have a huge number of hosting options to choose from, each with different advantages and disadvantages.
cs: V dnešní době můžete vybírat z velkého počtu možností hostingu. Každá má jiné klady a zápory.

source: These example hook files end with .sample; you’ll need to rename them.
cs: Ukázkové soubory zásuvných modulů končí příponou .sample, budete je muset přejmenovat.

source: These examples use a very simple project called `simplegit` that I often use for demonstrations.
cs: Následující příklady ukazují velmi jednoduchý projekt pojmenovaný `simplegit`, který pro názornost často používám.

source: These features help encourage developers to create and use branches often.
cs: Tyto funkce slouží k tomu, aby se vývojáři nebáli vytvářet a používat nové větve.

source: These files are pulled out of the compressed database in the Git directory and placed on disk for you to use or modify.
cs: Tyto soubory jsou staženy ze zkomprimované databáze v adresáři Git a umístěny na disk, kde je můžete používat nebo upravovat.

source: These filters can be set to do all sorts of fun things.
cs: Tyto filtry lze nastavit k různým šikovným úkonům.

source: These instructions are similar to what we’ve already gone over.
cs: Tyto instrukce jsou podobné těm, které jsme už uváděli.

source: These instructions tell you exactly what to do.
cs: Tyto instrukce vám sdělují, že nyní můžete upravit revizi příkazem git commit --amend, a až budete se změnami hotovi, spustit příkaz git rebase --continue.

source: These options apply to the `git rebase` command as well.
cs: A toto nastavení platí také pro příkaz `git rebase`.

source: These path-specific settings are called Git attributes and are set either in a `.gitattributes` file in one of your directories (normally the root of your project) or in the `.git/info/attributes` file if you don’t want the attributes file committed with your project.
cs: Tomuto nastavení konkrétního umístění se říká atributy Git. Nastavují se buď v souboru `.gitattributes` v jednom z vašich adresářů (většinou kořenový adresář vašeho projektu), nebo v souboru `.git/info/attributes`, pokud nechcete, aby byl soubor s atributy zapsán spolu s projektem.

source: These protocols have a process on the remote end that is intelligent about Git — it can read local data and figure out what the client has or needs and generate custom data for it.
cs: Tyto protokoly mají na vzdáleném konci proces, který inteligentně spolupracuje se systémem Git. Umí načítat lokální data a zjistí, co klient vlastní a co potřebuje. Podle toho pro něj vygeneruje potřebná data.

source: These scripts run before and after pushes to the server.
cs: Tyto skripty se spouštějí před odesíláním revizí na server i po něm.

source: These strategies are automatically chosen for you because the recursive strategy can handle complex three-way merge situations — for example, more than one common ancestor — but it can only handle merging two branches.
cs: Git vybírá tyto strategie automaticky, protože rekurzivní strategie zvládá složité třícestné slučování (například s více než jedním společným předkem), ale nedokáže sloučit více než dvě větve.

source: These systems (CVS, Subversion, Perforce, Bazaar, and so on) think of the information they keep as a set of files and the changes made to each file over time, as illustrated in Figure 1-4.
cs: Tyto systémy (CVS, Perforce, Bazaar atd.) chápou uložené informace jako sadu souborů a seznamů změn těchto souborů v čase — viz obrázek 1-4.

source: These systems, such as CVS, Subversion, and Perforce, have a single server that contains all the versioned files, and a number of clients that check out files from that central place.
cs: Tyto systémy, jmenovitě např. CVS, Subversion či Perforce, obsahují serverovou část, která uchovává všechny verzované soubory. Z tohoto centrálního úložiště si potom soubory stahují jednotliví klienti.

source: These three main Git objects — the blob, the tree, and the commit — are initially stored as separate files in your `.git/objects` directory.
cs: Tyto tři základní objekty Git – bloby, stromy a revize – jsou nejprve uloženy jako samostatné soubory do adresáře `.git/objects`.

source: These tools are very helpful if you modify a bunch of files and then decide that you want those changes to be in several focused commits rather than one big messy commit.
cs: Tyto nástroje se vám mohou velmi hodit, jestliže upravujete několik souborů a rozhodnete se, že tyto změny zapíšete raději do několika specializovaných revizí než do jedné velké nepřehledné.

source: These values are specific to that single repository.
cs: Tyto hodnoty platí pouze pro tento konkrétní repozitář.

source: These variables can be stored in three different places:
cs: Tyto proměnné mohou být uloženy na třech různých místech:

source: They aren’t necessarily obvious but are helpful to know.
cs: Není nezbytně nutné, abyste je všechny znali, ale mohou být užitečné.

source: They can add your repository as a remote, test your changes locally, merge them into their branch, and push back to their repository.
cs: Správce může váš repozitář přidat jako vzdálený repozitář, lokálně otestovat vaše změny, začlenit je do své větve a odeslat zpět do svého repozitáře.

source: They can use that key to verify all your signed tags.
cs: Klíč pak může použít k ověření všech vašich podepsaných značek.

source: They have another parallel branch named develop or next that they work from or use to test stability — it isn’t necessarily always stable, but whenever it gets to a stable state, it can be merged into `master`.
cs: Kromě ní mají další paralelní větev, pojmenovanou `develop` nebo `next`, v níž skutečně pracují nebo testují stabilitu kódu. Tato větev nemusí být nutně stabilní, ale jakmile se dostane do stabilního stavu, může být začleněna do větve `master`.

source: They take the form `(remote)/(branch)`.
cs: Vzdálené větve mají podobu `(vzdálený repozitář)/(větev)`.

source: They will be told that they’re trying to push non-fast-forward changes and that they won’t be able to do so until they fetch and merge.
cs: Git vývojáři při odmítnutí sdělí, že se pokouší odeslat změny, které nesměřují „rychle vpřed“, což není možné provést, dokud nevyzvedne a nezačlení (fetch and merge) stávající data z repozitáře.

source: They will stay as modified files on your disk.
cs: Zůstanou na vašem disku jako změněné soubory.

source: They’re all also within the packfile you just downloaded, so you don’t have to do any more requests to your server.
cs: Všechny jsou navíc součástí balíčkového souboru, který jste právě stáhli, a proto nebude nutné zadávat serveru žádné další požadavky.

source: They’re all equivalent, because Git expands each of them to `refs/remotes/origin/master`.
cs: Všechny tři jsou přitom ekvivalentní, protože Git vždy rozšíří jejich podobu na `refs/remotes/origin/master`.

source: They’re all invoked by the `git am` command, so if you aren’t using that command in your workflow, you can safely skip to the next section.
cs: Všechny tři se spouštějí spolu s příkazem `git am`, takže pokud tento příkaz nepoužíváte, můžete beze všeho přeskočit rovnou na následující část.

source: They’re checksummed; contain the tagger name, e-mail, and date; have a tagging message; and can be signed and verified with GNU Privacy Guard (GPG).
cs: U anotovaných značek se provádí kontrolní součet. Obsahují jméno autora značky (tagger), e-mail a datum, nesou vlastní zprávu (tagging message) a mohou být podepsány (signed) a ověřeny (verified) v programu GNU Privacy Guard (GPG).

source: They’re local branches that you can’t move; they’re moved automatically whenever you do any network communication.
cs: Jsou to lokální větve, které nemůžete přesouvat. Přesouvají se automaticky při síťové komunikaci.

source: They’re often used to enforce certain policies, although it’s important to note that these scripts aren’t transferred during a clone.
cs: Často se používají jako ujištění, že budou dodržovány stanovené standardy. Tady je však nutné upozornit, že se tyto skripty při klonování nepřenášejí.

source: This Perl snippet strips out anything it sees in a `$Date$` string, to get back to where you started.
cs: Tento fragment Perl vyjme vše, co najde v řetězci `$Date$`, čímž se vrátí zpět do stavu, kde jste začali.

source: This allows you to introduce all the changes from another branch and then make more changes before recording the new commit.
cs: To vám umožní provést všechny změny z jiné větve a poté udělat více změn, než zaznamenáte novou revizi.

source: This allows you to set up several types of workflows that aren’t possible in centralized systems, such as hierarchical models.
cs: Můžete zavést několik typů pracovních postupů, které nejsou v centralizovaných systémech možné — jako jsou například hierarchické modely.

source: This also means that there is very little you can’t do if you’re offline or off VPN.
cs: To také znamená, že je jen velmi málo operací, které nemůžete provádět offline nebo bez připojení k VPN.

source: This also means the changes you make from this point forward will diverge from an older version of the project.
cs: To také znamená, že změny, které od teď provedete, se odštěpí od starší verze projektu.

source: This also refers to the first parent, so `HEAD~` and `HEAD^` are equivalent.
cs: Také tento znak označuje prvního rodiče, výrazy `HEAD~` a `HEAD^` jsou proto ekvivalentní.

source: This also works with options, which is probably more useful.
cs: Automatické dokončování pravděpodobně více využijete v případě parametrů.

source: This approach also makes it easier to pull out or revert one of the changesets if you need to later.
cs: Díky tomuto přístupu také později snáze vyjmete nebo vrátíte některou z provedených změn, bude-li to třeba.

source: This approach is very common because it is so simple, but it is also incredibly error prone.
cs: Takový přístup je velmi častý, protože je jednoduchý. Je s ním však spojeno také velké riziko omylů a chyb.

source: This basically asks Git to resolve a range of commits that are reachable from one commit but aren’t reachable from another.
cs: Pomocí ní systému Git v podstatě říkáte, aby uvažoval celý interval revizí, které jsou dostupné z jedné revize, ale nejsou dostupné z jiné.

source: This basically says, “Check out the client branch, figure out the patches from the common ancestor of the `client` and `server` branches, and then replay them onto `master`.” It’s a bit complex; but the result, shown in Figure 3-32, is pretty cool.
cs: Tím v podstatě říkáte: „Proveď checkout větve `client`, zjisti záplaty ze společného předka větví `client` a `server` a znovu je aplikuj na hlavní větev `master`.“ Postup je možná trochu složitý, ale výsledek, znázorněný na obrázku 3-32, stojí opravdu za to.

source: This book covers how to use Git with 30 or so verbs such as `checkout`, `branch`, `remote`, and so on.
cs: V této knize jsme dosud uvedli asi 30 příkazů, které se používají k ovládání systému Git, např. `checkout`, `branch` nebo `remote`.

source: This can also be written `HEAD^^^`, which again is the first parent of the first parent of the first parent:
cs: Totéž by bylo možné označit výrazem `HEAD^^^`, který opět udává prvního rodiče prvního rodiče prvního rodiče:

source: This can be a huge problem when you’re converting Subversion or Perforce repositories into Git.
cs: To může způsobovat velké problémy, pokud konvertujete repozitáře Subversion nebo Perforce do systému Git.

source: This can be confusing, because if you’ve staged all of your changes, `git diff` will give you no output.
cs: To může být občas matoucí, protože pokud jste připravili všechny provedené změny, bude výstup příkazu `git diff` prázdný.

source: This can consist of accepting and applying patches generated via `format-patch` and e-mailed to you, or integrating changes in remote branches for repositories you’ve added as remotes to your project.
cs: Do této oblasti spadá přijímání a aplikace záplat vygenerovaných příkazem `format-patch`, které vám vývojáři poslali, nebo třeba integrace změn ve vzdálených větvích pro repozitáře, které jste do svého projektu přidali jako vzdálené repozitáře.

source: This can involve changing the order of the commits, changing messages or modifying files in a commit, squashing together or splitting apart commits, or removing commits entirely — all before you share your work with others.
cs: K této možnosti patří změna pořadí revizí, změny ve zprávách nebo úprava souborů v revizích, komprimace i dělení revizí nebo třeba jejich úplné odstranění. Všechno toto můžete provést, dokud nezačnete sdílet revize s ostatními.

source: This can take a while.
cs: Proces může chvíli trvat.

source: This can take several seconds or even minutes, depending on the size of the project, whereas in Git the process is always instantaneous.
cs: To může zabrat – podle velikosti projektu – několik sekund i minut, zatímco v systému Git probíhá tento proces vždy okamžitě.

source: This chapter covers every basic command you need to do the vast majority of the things you’ll eventually spend your time doing with Git.
cs: Tato kapitola popíše všechny základní příkazy, jejichž prováděním strávíte při práci se systémem Git drtivou většinu času.

source: This chapter has covered a number of plumbing commands — commands that are lower level and simpler than the porcelain commands you’ve learned about in the rest of the book.
cs: Seznámili jsme se s celou řadou nízkoúrovňových příkazů, tj. takových, které jsou na nižší úrovni a jsou jednodušší než „vysokoúrovňové příkazy“, jimiž jsme se zabývali ve všech předchozích kapitolách.

source: This chapter will be about getting started with Git.
cs: Tato kapitola vám ve stručnosti představí systém Git.

source: This combination effectively filters all C source code files through `indent` before committing.
cs: Tato kombinace ještě před zapsáním účinně přefiltruje veškeré zdrojové soubory pro jazyk C přes program `indent`.

source: This command adds a section to your `.git/config` that looks like this:
cs: Tento příkaz do vašeho `.git/config` přidá sekci, která vypadá následovně:
